# **Melt Function**

* Reshapes data from **wide format** to **long format**
* Turns multiple columns into two columns: variable + value
* Great for plotting and statistical analysis
* The melt function is the "Un-Pivoter". It changes your data from **Wide Format (good for humans)** to **Long Format (good for machines/plotting)**.

In [2]:
import  pandas as pd

In [3]:
df=pd.DataFrame({"Days":[1,2,3,4,5,6],"Eng":[12,34,23,53,64,63],"Maths":[33,52,51,20,83,24],"Science":[53,45,24,64,22,74]})
df

   Days  Eng  Maths  Science
0     1   12     33       53
1     2   34     52       45
2     3   23     51       24
3     4   53     20       64
4     5   64     83       22
5     6   63     24       74

## `melt()`

**Basic Syntax :**
```python
pd.melt(
    df,
    id_vars=['id_column1', 'id_column2'],   # columns to keep fixed
    value_vars=['col1','col2'],             # columns to unpivot
    var_name='Variable',                    # name for new column
    value_name='Value'                      # name for values
)
```


| Parameter      | Type         | Default      | What it Does                                     | When to Use                                 |
| -------------- | ------------ | ------------ | ------------------------------------------------ | ------------------------------------------- |
| `frame`        | DataFrame    | â€”            | The DataFrame to reshape                         | Always required                             |
| `id_vars`      | list / tuple | `None`       | Columns to **keep fixed** (identifier columns)   | IDs like `UserID`, `Date`, `Product`        |
| `value_vars`   | list / tuple | `None`       | Columns to **unpivot**                           | When you want to melt only selected columns |
| `var_name`     | str          | `'variable'` | Name of the column storing original column names | Use meaningful names like `"Month"`         |
| `value_name`   | str          | `'value'`    | Name of the column storing values                | Rename to `"Sales"`, `"Revenue"`            |
| `col_level`    | int / str    | `None`       | Which level to melt when columns are MultiIndex  | Advanced / hierarchical columns             |
| `ignore_index` | bool         | `True`       | Reset index after melting                        | Set `False` to keep original index          |

In [11]:
pd.melt(df)
pd.melt(df,id_vars=['Days'])
pd.melt(df,id_vars=['Days'],value_vars=['Maths','Eng'])
pd.melt(df,id_vars=['Days'],var_name='Python',value_name='Java')
pd.melt(df,id_vars=['Days'],value_vars=['Maths','Eng'],var_name='Python',value_name='Java')

    Days Python  Java
0      1  Maths    33
1      2  Maths    52
2      3  Maths    51
3      4  Maths    20
4      5  Maths    83
5      6  Maths    24
6      1    Eng    12
7      2    Eng    34
8      3    Eng    23
9      4    Eng    53
10     5    Eng    64
11     6    Eng    63

---
# **Practice Problems**

In [12]:
sales = pd.DataFrame({
    'Product': ['Pen', 'Book', 'Bag'],
    'Jan': [100, 150, 80],
    'Feb': [120, 130, 90],
    'Mar': [110, 140, 100]
})

### ðŸ§  Problem 11

Convert `sales` into **long format** with columns:

> Product | Month | Units

In [19]:
pd.melt(sales,id_vars=['Product'],var_name='Months',value_name='Units')

  Product Months  Units
0     Pen    Jan    100
1    Book    Jan    150
2     Bag    Jan     80
3     Pen    Feb    120
4    Book    Feb    130
5     Bag    Feb     90
6     Pen    Mar    110
7    Book    Mar    140
8     Bag    Mar    100

### ðŸ§  Problem 12

Rename the melted columns to:

* `Month`
* `Units_Sold`

### ðŸ§  Problem 13

Filter melted data to show **only February sales**.